In [7]:
import pandas as pd
import os
os.getcwd()
change="C:\\Users\\talib\\Downloads"
os.chdir(change)
os.getcwd()
df=''
for file in os.listdir():
    if file.endswith(".csv") and file.startswith("sales"):
        df=pd.read_csv(file)
df.head()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
0,101,Frozen,Chocolate,3,114.41,EMP002
1,102,Beverage,Chocolate,1,106.83,EMP003
2,103,Dessert,Brownie,2,111.88,EMP004
3,104,Dessert,Coffee,2,145.81,EMP002
4,105,Frozen,Kulfi,4,130.38,EMP001

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   transaction_id      50 non-null     int64
 1   product_type        50 non-null     object
 2   flavor              50 non-null     object
 3   quantity            50 non-null     int64
 4   price_per_unit_inr  50 non-null     float64
 5   staff_id            50 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 2.5+ KB

In [9]:
df['product_type'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 50 entries, 0 to 49
Series name: product_type
Non-Null Count  Dtype
--------------  -----
50 non-null     object
dtypes: object(1)
memory usage: 532.0+ bytes

In [10]:
df.describe()

       transaction_id   quantity  price_per_unit_inr
count        50.00000  50.000000            50.00000
mean        125.50000   3.100000           139.45620
std          14.57738   1.446318            27.22554
min         101.00000   1.000000            93.31000
25%         113.25000   2.000000           114.86500
50%         125.50000   3.000000           138.92500
75%         137.75000   4.000000           160.74000
max         150.00000   5.000000           189.77000

In [14]:
df["quantity"].describe()

count    50.000000
mean      3.100000
std       1.446318
min       1.000000
25%       2.000000
50%       3.000000
75%       4.000000
max       5.000000
Name: quantity, dtype: float64

In [15]:
df.shape

(50, 6)

In [16]:
df.ndim

2

In [17]:
df.size

300

In [20]:
df.nunique()

transaction_id        50
product_type           3
flavor                 9
quantity               5
price_per_unit_inr    50
staff_id               5
dtype: int64

In [21]:
df["product_type"].nunique()

3

In [22]:
df.index

RangeIndex(start=0, stop=50, step=1)

In [23]:
df.columns

Index(['transaction_id', 'product_type', 'flavor', 'quantity',
       'price_per_unit_inr', 'staff_id'],
      dtype='object')

In [24]:
df.head()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
0,101,Frozen,Chocolate,3,114.41,EMP002
1,102,Beverage,Chocolate,1,106.83,EMP003
2,103,Dessert,Brownie,2,111.88,EMP004
3,104,Dessert,Coffee,2,145.81,EMP002
4,105,Frozen,Kulfi,4,130.38,EMP001

In [25]:
df1=df.groupby("product_type")["quantity"].sum().reset_index()
df1

  product_type  quantity
0     Beverage        18
1      Dessert        44
2       Frozen        93

In [27]:
df2=df.groupby("flavor")["quantity"].sum().reset_index()
df2

       flavor  quantity
0     Brownie         2
1   Chocolate         9
2      Coffee        31
3       Kulfi        21
4       Mango        20
5       Pista        18
6  Strawberry         1
7         Tea        31
8     Vanilla        22

In [29]:
df3=df.groupby(["product_type","flavor"])["quantity"].sum()
df3

product_type  flavor
Beverage      Chocolate      2
              Kulfi          1
              Pista          1
              Tea           10
              Vanilla        4
Dessert       Brownie        2
              Chocolate      4
              Coffee         7
              Kulfi          7
              Mango          4
              Pista         17
              Vanilla        3
Frozen        Chocolate      3
              Coffee        24
              Kulfi         13
              Mango         16
              Strawberry     1
              Tea           21
              Vanilla       15
Name: quantity, dtype: int64

In [34]:
df4=df.groupby(["transaction_id","product_type","flavor"])["quantity"].sum().reset_index()
df4.head()

   transaction_id product_type     flavor  quantity
0             101       Frozen  Chocolate         3
1             102     Beverage  Chocolate         1
2             103      Dessert    Brownie         2
3             104      Dessert     Coffee         2
4             105       Frozen      Kulfi         4

In [33]:
df.head()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
0,101,Frozen,Chocolate,3,114.41,EMP002
1,102,Beverage,Chocolate,1,106.83,EMP003
2,103,Dessert,Brownie,2,111.88,EMP004
3,104,Dessert,Coffee,2,145.81,EMP002
4,105,Frozen,Kulfi,4,130.38,EMP001

In [37]:
df5=df.groupby(["product_type","flavor"])[["quantity","price_per_unit_inr"]].sum().reset_index()
df5.head()

  product_type     flavor  quantity  price_per_unit_inr
0     Beverage  Chocolate         2              247.65
1     Beverage      Kulfi         1              175.84
2     Beverage      Pista         1              114.69
3     Beverage        Tea        10              306.45
4     Beverage    Vanilla         4              289.34

In [41]:
df6=df.loc[0]
df6

transaction_id              101
product_type             Frozen
flavor                Chocolate
quantity                      3
price_per_unit_inr       114.41
staff_id                 EMP002
Name: 0, dtype: object

In [43]:
df7=df.loc[[0]]
df7

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
0,101,Frozen,Chocolate,3,114.41,EMP002

In [51]:
df8=df.loc[(df["product_type"]=="Frozen")]
df8.head()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
0,101,Frozen,Chocolate,3,114.41,EMP002
4,105,Frozen,Kulfi,4,130.38,EMP001
5,106,Frozen,Tea,5,96.49,EMP004
6,107,Frozen,Coffee,3,115.39,EMP004
10,111,Frozen,Coffee,4,104.81,EMP004

In [54]:
df9=df.loc[(df["price_per_unit_inr"]>170)]
df9

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
11,112,Beverage,Tea,5,189.77,EMP005
13,114,Frozen,Vanilla,3,187.66,EMP003
26,127,Frozen,Vanilla,4,170.31,EMP003
28,129,Dessert,Kulfi,4,188.34,EMP003
30,131,Dessert,Kulfi,3,171.64,EMP005
35,136,Beverage,Kulfi,1,175.84,EMP005
39,140,Frozen,Mango,4,170.95,EMP004
42,143,Frozen,Mango,3,184.05,EMP004
45,146,Dessert,Pista,5,173.77,EMP001

In [57]:
df10=df.loc[(df["product_type"]=="Beverage") & (df["flavor"]=="Tea")]
df10

    transaction_id product_type flavor  quantity  price_per_unit_inr staff_id
11             112     Beverage    Tea         5              189.77   EMP005
12             113     Beverage    Tea         5              116.68   EMP005

In [58]:
df11=df.loc[(df["staff_id"]=="EMP005")]
df11

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
11,112,Beverage,Tea,5,189.77,EMP005
12,113,Beverage,Tea,5,116.68,EMP005
30,131,Dessert,Kulfi,3,171.64,EMP005
35,136,Beverage,Kulfi,1,175.84,EMP005
41,142,Frozen,Strawberry,1,99.62,EMP005
49,150,Frozen,Kulfi,4,144.14,EMP005

In [64]:
df12=df.loc[(df["staff_id"]=="EMP003") ]
df12[["product_type","flavor"]]

   product_type     flavor
1      Beverage  Chocolate
13       Frozen    Vanilla
16       Frozen        Tea
17      Dessert     Coffee
18       Frozen    Vanilla
22       Frozen    Vanilla
26       Frozen    Vanilla
28      Dessert      Kulfi
34     Beverage    Vanilla
43     Beverage    Vanilla
47      Dessert    Vanilla
48      Dessert      Pista

In [68]:
df13=df.loc[(df["staff_id"]=="EMP001")]
print(df13[["price_per_unit_inr","quantity"]].sum())

price_per_unit_inr    1854.62
quantity                43.00
dtype: float64

In [78]:
df14=df.loc[(df["staff_id"]=="EMP002") & (df["flavor"]=="Chocolate")]
print(df14[["price_per_unit_inr","quantity"]].sum())

price_per_unit_inr    414.86
quantity                8.00
dtype: float64

In [79]:
df15=df.loc[(df["staff_id"]=="EMP002") & (df["flavor"]=="Chocolate")]
df15

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
0,101,Frozen,Chocolate,3,114.41,EMP002
8,109,Dessert,Chocolate,4,159.63,EMP002
33,134,Beverage,Chocolate,1,140.82,EMP002

In [82]:
df16=df.groupby("flavor")["price_per_unit_inr"].rolling(window=2).mean()
df16.head()

flavor
Brownie    2         NaN
Chocolate  0         NaN
           1     110.620
           8     133.230
           33    150.225
Name: price_per_unit_inr, dtype: float64

In [83]:
df["flavor"].value_counts()

flavor
Coffee        10
Mango          7
Kulfi          7
Tea            7
Vanilla        7
Pista          6
Chocolate      4
Brownie        1
Strawberry     1
Name: count, dtype: int64

In [87]:
df.value_counts(["product_type","flavor"])

product_type  flavor
Frozen        Coffee        7
              Mango         6
Dessert       Pista         5
Frozen        Tea           5
              Kulfi         4
              Vanilla       4
Dessert       Coffee        3
Beverage      Vanilla       2
Dessert       Kulfi         2
Beverage      Chocolate     2
              Tea           2
              Pista         1
              Kulfi         1
Dessert       Brownie       1
              Chocolate     1
              Mango         1
Frozen        Chocolate     1
Dessert       Vanilla       1
Frozen        Strawberry    1
Name: count, dtype: int64

In [88]:
df17=df.rename(columns={"product_type":"product","price_per_unit_inr":"price"})
df17.head()

   transaction_id   product     flavor  quantity   price staff_id
0             101    Frozen  Chocolate         3  114.41   EMP002
1             102  Beverage  Chocolate         1  106.83   EMP003
2             103   Dessert    Brownie         2  111.88   EMP004
3             104   Dessert     Coffee         2  145.81   EMP002
4             105    Frozen      Kulfi         4  130.38   EMP001

In [91]:
#df18["New_price"]=df.groupby(["product_type","flavor"]).agg(["sum","max" ,"mean"})

In [92]:
import numpy as np
s_data=pd.Series([np.nan,np.nan,np.nan,np.nan,np.nan,np.nan],index=df.columns)
s_data

transaction_id       NaN
product_type         NaN
flavor               NaN
quantity             NaN
price_per_unit_inr   NaN
staff_id             NaN
dtype: float64

In [93]:
new_data=pd.concat([df,s_data.to_frame().T],ignore_index=True)
new_data.tail()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
46,147.0,Frozen,Mango,1.0,157.57,EMP004
47,148.0,Dessert,Vanilla,3.0,163.52,EMP003
48,149.0,Dessert,Pista,2.0,110.91,EMP003
49,150.0,Frozen,Kulfi,4.0,144.14,EMP005
50,NaN,NaN,NaN,NaN,NaN,NaN

In [100]:
fill=new_data.fillna(0)
fill.tail()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
46,147.0,Frozen,Mango,1.0,157.57,EMP004
47,148.0,Dessert,Vanilla,3.0,163.52,EMP003
48,149.0,Dessert,Pista,2.0,110.91,EMP003
49,150.0,Frozen,Kulfi,4.0,144.14,EMP005
50,0.0,0,0,0.0,0.00,0

In [103]:
fill_value=new_data.groupby(["price_per_unit_inr","flavor"]).fillna(0)
fill_value.head()

C:\Users\talib\AppData\Local\Temp\ipykernel_12112\4056361656.py:1: FutureWarning: DataFrameGroupBy.fillna is deprecated and will be removed in a future version. Use obj.ffill() or obj.bfill() for forward or backward filling instead. If you want to fill with a single value, use DataFrame.fillna instead
  fill_value=new_data.groupby(["price_per_unit_inr","flavor"]).fillna(0)

   transaction_id product_type  quantity staff_id
0           112.0     Beverage       5.0   EMP005
1           107.0       Frozen       3.0   EMP004
2           109.0      Dessert       4.0   EMP002
3           131.0      Dessert       3.0   EMP005
4           122.0       Frozen       2.0   EMP004

In [105]:
drop_row=new_data.drop([50])
drop_row.tail()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
45,146.0,Dessert,Pista,5.0,173.77,EMP001
46,147.0,Frozen,Mango,1.0,157.57,EMP004
47,148.0,Dessert,Vanilla,3.0,163.52,EMP003
48,149.0,Dessert,Pista,2.0,110.91,EMP003
49,150.0,Frozen,Kulfi,4.0,144.14,EMP005

In [107]:
drop2=new_data.drop(columns="flavor")
drop2.tail()

    transaction_id product_type  quantity  price_per_unit_inr staff_id
46           147.0       Frozen       1.0              157.57   EMP004
47           148.0      Dessert       3.0              163.52   EMP003
48           149.0      Dessert       2.0              110.91   EMP003
49           150.0       Frozen       4.0              144.14   EMP005
50             NaN          NaN       NaN                 NaN      NaN

In [108]:
drop3=new_data.drop(columns=["flavor","quantity"])
drop3.head()

   transaction_id product_type  price_per_unit_inr staff_id
0           101.0       Frozen              114.41   EMP002
1           102.0     Beverage              106.83   EMP003
2           103.0      Dessert              111.88   EMP004
3           104.0      Dessert              145.81   EMP002
4           105.0       Frozen              130.38   EMP001

In [111]:
re_name=new_data.rename(columns={"product_type":"p_type","price_per_unit_inr":"price"})
re_name.head()

   transaction_id    p_type     flavor  quantity   price staff_id
0           101.0    Frozen  Chocolate       3.0  114.41   EMP002
1           102.0  Beverage  Chocolate       1.0  106.83   EMP003
2           103.0   Dessert    Brownie       2.0  111.88   EMP004
3           104.0   Dessert     Coffee       2.0  145.81   EMP002
4           105.0    Frozen      Kulfi       4.0  130.38   EMP001

In [112]:
df=df.dropna()

In [114]:
df.tail()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
45,146,Dessert,Pista,5,173.77,EMP001
46,147,Frozen,Mango,1,157.57,EMP004
47,148,Dessert,Vanilla,3,163.52,EMP003
48,149,Dessert,Pista,2,110.91,EMP003
49,150,Frozen,Kulfi,4,144.14,EMP005

In [121]:
import pandas as pd
import os
os.getcwd()
file_name="sales_transactions_50.csv"
chunk_size=10
revenue=0
for chunk in pd.read_csv(file_name,chunksize=chunk_size):
    chunk["Total_price"]=chunk["price_per_unit_inr"]*chunk["quantity"]
    revenue+=chunk["Total_price"].sum()
    print(f"Current Total_price is: {revenue:.2f} INR")
print(f"final price is : {revenue:.2f} INR")

Current Total_price is: 3874.94 INR
Current Total_price is: 9547.59 INR
Current Total_price is: 14546.14 INR
Current Total_price is: 17600.81 INR
Current Total_price is: 21723.35 INR
final price is : 21723.35 INR

In [122]:
import pandas as pd
data = {
    'product_id': [101, 102, 103, 104, 105, 106],
    'product_name': ['Vanilla', 'Mango', 'Kesar Pista', 'Chocolate', 'Strawberry','ChocoChips'],
    'price_per_unit_inr': [45000, 800, 1200, 15000, 2500,2500],
    'quantity': [10, 50, 30, 5, 20,30]
}
df=pd.DataFrame(data)
df

   product_id product_name  price_per_unit_inr  quantity
0         101      Vanilla               45000        10
1         102        Mango                 800        50
2         103  Kesar Pista                1200        30
3         104    Chocolate               15000         5
4         105   Strawberry                2500        20
5         106   ChocoChips                2500        30

In [124]:
df1=df.sort_values(by="quantity")
df1.head()

   product_id product_name  price_per_unit_inr  quantity
3         104    Chocolate               15000         5
0         101      Vanilla               45000        10
4         105   Strawberry                2500        20
2         103  Kesar Pista                1200        30
5         106   ChocoChips                2500        30

In [126]:
df2=df.sort_values(by=["price_per_unit_inr","quantity"],ascending=[False,True])
df2.head()

   product_id product_name  price_per_unit_inr  quantity
0         101      Vanilla               45000        10
3         104    Chocolate               15000         5
4         105   Strawberry                2500        20
5         106   ChocoChips                2500        30
2         103  Kesar Pista                1200        30

In [128]:
df3=df.groupby(["product_name","price_per_unit_inr"]).agg(total_price=("price_per_unit_inr","sum"),avg_quant=("quantity","mean"))
df3

                                 total_price  avg_quant
product_name price_per_unit_inr
ChocoChips   2500                       2500       30.0
Chocolate    15000                     15000        5.0
Kesar Pista  1200                       1200       30.0
Mango        800                         800       50.0
Strawberry   2500                       2500       20.0
Vanilla      45000                     45000       10.0

In [131]:
import pandas as pd
import os
os.getcwd()
df1=pd.read_csv("sales_transactions_50.csv")
df2=pd.read_csv("shop_details.csv")
df2.head()

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1         10           10     10          10       10           10
2         10           10     10          10       10           10
3       P004       Lotion    150         200     Skin           15
4       P005          Oil     95         400     Hair           12

In [149]:
df2=df2.rename(columns={"Price":"price"})
df2.head()

  Product_ID Product_Name  price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1         10           10     10          10       10           10
2         10           10     10          10       10           10
3       P004       Lotion    150         200     Skin           15
4       P005          Oil     95         400     Hair           12

In [132]:
df1.head()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
0,101,Frozen,Chocolate,3,114.41,EMP002
1,102,Beverage,Chocolate,1,106.83,EMP003
2,103,Dessert,Brownie,2,111.88,EMP004
3,104,Dessert,Coffee,2,145.81,EMP002
4,105,Frozen,Kulfi,4,130.38,EMP001

In [134]:
df1=df1.rename(columns={"price_per_unit_inr":"price"})
df1.head()

   transaction_id product_type     flavor  quantity   price staff_id
0             101       Frozen  Chocolate         3  114.41   EMP002
1             102     Beverage  Chocolate         1  106.83   EMP003
2             103      Dessert    Brownie         2  111.88   EMP004
3             104      Dessert     Coffee         2  145.81   EMP002
4             105       Frozen      Kulfi         4  130.38   EMP001

In [140]:
new_data_set=pd.concat([df1,df2],ignore_index=True)

In [142]:
new_data.tail()

,transaction_id,product_type,flavor,quantity,price_per_unit_inr,staff_id
46,147.0,Frozen,Mango,1.0,157.57,EMP004
47,148.0,Dessert,Vanilla,3.0,163.52,EMP003
48,149.0,Dessert,Pista,2.0,110.91,EMP003
49,150.0,Frozen,Kulfi,4.0,144.14,EMP005
50,NaN,NaN,NaN,NaN,NaN,NaN

In [145]:
df1.head()

   transaction_id product_type     flavor  quantity   price staff_id
0             101       Frozen  Chocolate         3  114.41   EMP002
1             102     Beverage  Chocolate         1  106.83   EMP003
2             103      Dessert    Brownie         2  111.88   EMP004
3             104      Dessert     Coffee         2  145.81   EMP002
4             105       Frozen      Kulfi         4  130.38   EMP001

In [153]:
merged_df=pd.merge(df1,df2,on="price",how="outer")
len(merged_df)

C:\Users\talib\AppData\Local\Temp\ipykernel_12112\3460623255.py:1: UserWarning: You are merging on int and float columns where the float values are not equal to their int representation.
  merged_df=pd.merge(df1,df2,on="price",how="outer")

57

In [154]:
merged_df=pd.merge(df1,df2,on="price",how="left")
len(merged_df)

C:\Users\talib\AppData\Local\Temp\ipykernel_12112\2360777036.py:1: UserWarning: You are merging on int and float columns where the float values are not equal to their int representation.
  merged_df=pd.merge(df1,df2,on="price",how="left")

50

In [155]:
merged_df=pd.merge(df1,df2,on="price",how="left")
len(merged_df)

C:\Users\talib\AppData\Local\Temp\ipykernel_12112\2360777036.py:1: UserWarning: You are merging on int and float columns where the float values are not equal to their int representation.
  merged_df=pd.merge(df1,df2,on="price",how="left")

50

In [156]:
merged_df=pd.merge(df1,df2,on="price",how="inner")
len(merged_df)

C:\Users\talib\AppData\Local\Temp\ipykernel_12112\885957736.py:1: UserWarning: You are merging on int and float columns where the float values are not equal to their int representation.
  merged_df=pd.merge(df1,df2,on="price",how="inner")

0

In [157]:
df1.head(2)

   transaction_id product_type     flavor  quantity   price staff_id
0             101       Frozen  Chocolate         3  114.41   EMP002
1             102     Beverage  Chocolate         1  106.83   EMP003

In [159]:
df2.head(2)

  Product_ID Product_Name  price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1         10           10     10          10       10           10

In [163]:
n1=df1.drop(columns="staff_id")
n1.head()

   transaction_id product_type     flavor  quantity   price
0             101       Frozen  Chocolate         3  114.41
1             102     Beverage  Chocolate         1  106.83
2             103      Dessert    Brownie         2  111.88
3             104      Dessert     Coffee         2  145.81
4             105       Frozen      Kulfi         4  130.38

In [165]:
n2=df2.drop(columns="Discount(%)")
n2.head(2)

  Product_ID Product_Name  price  Units_Sold Category
0       P001         Soap     30         500     Bath
1         10           10     10          10       10

In [166]:
df3=n1.rename(columns={"transaction_id":"Product_ID","product_type":"Category","flavor":"Product_Name","quantity":"Units_Sold"})
df3.head(1)

   Product_ID Category Product_Name  Units_Sold   price
0         101   Frozen    Chocolate           3  114.41

In [167]:
new_data2=pd.concat([df3,n2],ignore_index=True)
new_data2.head()

  Product_ID  Category Product_Name  Units_Sold   price
0        101    Frozen    Chocolate           3  114.41
1        102  Beverage    Chocolate           1  106.83
2        103   Dessert      Brownie           2  111.88
3        104   Dessert       Coffee           2  145.81
4        105    Frozen        Kulfi           4  130.38

In [169]:
new_data2.tail()

   Product_ID Category Product_Name  Units_Sold  price
52         10       10           10          10   10.0
53       P004     Skin       Lotion         200  150.0
54       P005     Hair          Oil         400   95.0
55       P006     Skin        Cream         350   60.0
56       P007     Bath       Powder         250   40.0

In [170]:
import pandas as pd
import numpy as np

data = {
    'Order_ID': [101, 102, 103, 104, 105, 106, 107],
    'Date': ['2025-08-01', '2025-08-01', '2025-08-02', '2025-08-02', '2025-08-03', '2025-08-03', '2025-08-04'],
    'Item': ['Vanilla', 'Chocolate', 'Pista', 'Vanilla', 'Chocolate', np.nan, 'Vanilla'],
    'Quantity': [2, 3, 1, 4, 2, 1, 5],
    'Price_INR': [120, 150, 180, 120, 150, 150, 120],
    'Discount_Code': [np.nan, 'SUMMER25', np.nan, np.nan, 'SUMMER25', 'SAVE10', np.nan],
    'Salesperson': ['Priya', 'Amit', 'Neha', 'Priya', 'Amit', 'Priya', 'Neha']
}
df=pd.DataFrame(data)
df.head()

,Order_ID,Date,Item,Quantity,Price_INR,Discount_Code,Salesperson
0,101,2025-08-01,Vanilla,2,120,NaN,Priya
1,102,2025-08-01,Chocolate,3,150,SUMMER25,Amit
2,103,2025-08-02,Pista,1,180,NaN,Neha
3,104,2025-08-02,Vanilla,4,120,NaN,Priya
4,105,2025-08-03,Chocolate,2,150,SUMMER25,Amit

In [171]:
df.isnull().sum()

Order_ID         0
Date             0
Item             1
Quantity         0
Price_INR        0
Discount_Code    4
Salesperson      0
dtype: int64

In [173]:
df1=df.groupby(["Price_INR","Quantity"]).agg(mean=("Quantity","mean"),sum_of=("Price_INR","sum"))
df1

                    mean  sum_of
Price_INR Quantity
120       2          2.0     120
          4          4.0     120
          5          5.0     120
150       1          1.0     150
          2          2.0     150
          3          3.0     150
180       1          1.0     180

In [175]:
df2=df.sort_values(by=["Price_INR","Quantity"],ascending=[True,True])
df2

,Order_ID,Date,Item,Quantity,Price_INR,Discount_Code,Salesperson
0,101,2025-08-01,Vanilla,2,120,NaN,Priya
3,104,2025-08-02,Vanilla,4,120,NaN,Priya
6,107,2025-08-04,Vanilla,5,120,NaN,Neha
5,106,2025-08-03,NaN,1,150,SAVE10,Priya
4,105,2025-08-03,Chocolate,2,150,SUMMER25,Amit
1,102,2025-08-01,Chocolate,3,150,SUMMER25,Amit
2,103,2025-08-02,Pista,1,180,NaN,Neha

In [176]:
series_data=pd.Series([np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan],index=df.columns)
series_data

Order_ID        NaN
Date            NaN
Item            NaN
Quantity        NaN
Price_INR       NaN
Discount_Code   NaN
Salesperson     NaN
dtype: float64

In [177]:
dataset=pd.concat([df,series_data.to_frame().T],ignore_index=True)
dataset

,Order_ID,Date,Item,Quantity,Price_INR,Discount_Code,Salesperson
0,101.0,2025-08-01,Vanilla,2.0,120.0,NaN,Priya
1,102.0,2025-08-01,Chocolate,3.0,150.0,SUMMER25,Amit
2,103.0,2025-08-02,Pista,1.0,180.0,NaN,Neha
3,104.0,2025-08-02,Vanilla,4.0,120.0,NaN,Priya
4,105.0,2025-08-03,Chocolate,2.0,150.0,SUMMER25,Amit
5,106.0,2025-08-03,NaN,1.0,150.0,SAVE10,Priya
6,107.0,2025-08-04,Vanilla,5.0,120.0,NaN,Neha
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [179]:
data1=dataset.fillna(value={"Order_ID":0.0,"Item":"Unknown","Price_INR":0.0,"Discount_Code":"No_Discount","Salesperson":"Unknown","Quantity":0.0,"Date":"NOT_Avaialble"})
data1

,Order_ID,Date,Item,Quantity,Price_INR,Discount_Code,Salesperson
0,101.0,2025-08-01,Vanilla,2.0,120.0,No_Discount,Priya
1,102.0,2025-08-01,Chocolate,3.0,150.0,SUMMER25,Amit
2,103.0,2025-08-02,Pista,1.0,180.0,No_Discount,Neha
3,104.0,2025-08-02,Vanilla,4.0,120.0,No_Discount,Priya
4,105.0,2025-08-03,Chocolate,2.0,150.0,SUMMER25,Amit
5,106.0,2025-08-03,Unknown,1.0,150.0,SAVE10,Priya
6,107.0,2025-08-04,Vanilla,5.0,120.0,No_Discount,Neha
7,0.0,NOT_Avaialble,Unknown,0.0,0.0,No_Discount,Unknown

In [180]:
dataset.drop([0,3])

,Order_ID,Date,Item,Quantity,Price_INR,Discount_Code,Salesperson
1,102.0,2025-08-01,Chocolate,3.0,150.0,SUMMER25,Amit
2,103.0,2025-08-02,Pista,1.0,180.0,NaN,Neha
4,105.0,2025-08-03,Chocolate,2.0,150.0,SUMMER25,Amit
5,106.0,2025-08-03,NaN,1.0,150.0,SAVE10,Priya
6,107.0,2025-08-04,Vanilla,5.0,120.0,NaN,Neha
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [181]:
dataset.drop(columns=["Salesperson"])

   Order_ID        Date       Item  Quantity  Price_INR Discount_Code
0     101.0  2025-08-01    Vanilla       2.0      120.0           NaN
1     102.0  2025-08-01  Chocolate       3.0      150.0      SUMMER25
2     103.0  2025-08-02      Pista       1.0      180.0           NaN
3     104.0  2025-08-02    Vanilla       4.0      120.0           NaN
4     105.0  2025-08-03  Chocolate       2.0      150.0      SUMMER25
5     106.0  2025-08-03        NaN       1.0      150.0        SAVE10
6     107.0  2025-08-04    Vanilla       5.0      120.0           NaN
7       NaN         NaN        NaN       NaN        NaN           NaN

In [182]:
dataset.head()

,Order_ID,Date,Item,Quantity,Price_INR,Discount_Code,Salesperson
0,101.0,2025-08-01,Vanilla,2.0,120.0,NaN,Priya
1,102.0,2025-08-01,Chocolate,3.0,150.0,SUMMER25,Amit
2,103.0,2025-08-02,Pista,1.0,180.0,NaN,Neha
3,104.0,2025-08-02,Vanilla,4.0,120.0,NaN,Priya
4,105.0,2025-08-03,Chocolate,2.0,150.0,SUMMER25,Amit

In [183]:
dataset.dropna()

,Order_ID,Date,Item,Quantity,Price_INR,Discount_Code,Salesperson
1,102.0,2025-08-01,Chocolate,3.0,150.0,SUMMER25,Amit
4,105.0,2025-08-03,Chocolate,2.0,150.0,SUMMER25,Amit

In [26]:
import pandas as pd
import numpy as np
import os
import time
change=r"C:\Users\talib\OneDrive\Desktop"
os.chdir(change)
chunk_size=100000
revenue=0
start=time.time()
for chunk in pd.read_csv(file_name,chunksize=chunk_size):
    chunk["Total_Price"]=chunk["Price_INR"]*chunk["Quantity"]
    revenue+=chunk["Total_Price"].sum()
    end=time.time()
    print(f"Current revenue is : {revenue:.2f} INR")
    print(f"total time taken is :{end-start:.2f} sec")
print(f"final revenue is : {revenue:.2f} INR")

Current revenue is : 74849681.00 INR
total time taken is :0.27 sec
Current revenue is : 149660223.00 INR
total time taken is :0.52 sec
Current revenue is : 224680104.00 INR
total time taken is :0.77 sec
Current revenue is : 299352361.00 INR
total time taken is :1.00 sec
Current revenue is : 374069152.00 INR
total time taken is :1.21 sec
Current revenue is : 448663559.00 INR
total time taken is :1.45 sec
Current revenue is : 523364976.00 INR
total time taken is :1.68 sec
Current revenue is : 598166292.00 INR
total time taken is :1.92 sec
Current revenue is : 673028819.00 INR
total time taken is :2.16 sec
Current revenue is : 747889525.00 INR
total time taken is :2.40 sec
final revenue is : 747889525.00 INR

In [20]:
os.getcwd()

'C:\\USers\\talib\\Downloads'

In [27]:
import pandas as pd
import numpy as np
dates = pd.to_datetime(pd.date_range('2024-08-01', periods=10, freq='D'))
temperatures = np.array([30, 31, 30, 32, 33, 34, 32, 31, 30, 29])
daily_data = pd.DataFrame({'Date': dates, 'Temperature_C': temperatures})
print(daily_data)

        Date  Temperature_C
0 2024-08-01             30
1 2024-08-02             31
2 2024-08-03             30
3 2024-08-04             32
4 2024-08-05             33
5 2024-08-06             34
6 2024-08-07             32
7 2024-08-08             31
8 2024-08-09             30
9 2024-08-10             29

In [28]:
import pandas as pd
import numpy as np
dated=pd.to_datetime(pd.date_range('01-05-2025',periods=5,freq='D'))
sales=[100,200,500,3000,2000]
daily_sales=pd.DataFrame({"Date":dated,"Sale":sales})
print(daily_sales)

        Date  Sale
0 2025-01-05   100
1 2025-01-06   200
2 2025-01-07   500
3 2025-01-08  3000
4 2025-01-09  2000

In [30]:
import pandas as pd
import numpy as np
df=pd.date_range('2025-08-14',periods=3,freq='3h')
print(df)

DatetimeIndex(['2025-08-14 00:00:00', '2025-08-14 03:00:00',
               '2025-08-14 06:00:00'],
              dtype='datetime64[ns]', freq='3h')

In [31]:
df1=pd.to_datetime(pd.date_range(start='2020-07-21',end='2020-07-30',freq='D'))
df1

DatetimeIndex(['2020-07-21', '2020-07-22', '2020-07-23', '2020-07-24',
               '2020-07-25', '2020-07-26', '2020-07-27', '2020-07-28',
               '2020-07-29', '2020-07-30'],
              dtype='datetime64[ns]', freq='D')

In [33]:
df2=pd.to_datetime(pd.date_range('2025-08-14',periods=5,freq="W"))
df2

DatetimeIndex(['2025-08-17', '2025-08-24', '2025-08-31', '2025-09-07',
               '2025-09-14'],
              dtype='datetime64[ns]', freq='W-SUN')

In [36]:
df3=pd.to_datetime(pd.date_range('2045-11-24',periods=6,freq="D"))
df3

DatetimeIndex(['2045-11-24', '2045-11-25', '2045-11-26', '2045-11-27',
               '2045-11-28', '2045-11-29'],
              dtype='datetime64[ns]', freq='D')

In [37]:
df4=pd.to_datetime(pd.date_range(start='2025-01-01',end='2025-08-08',freq="W-MON"))
df4

DatetimeIndex(['2025-01-06', '2025-01-13', '2025-01-20', '2025-01-27',
               '2025-02-03', '2025-02-10', '2025-02-17', '2025-02-24',
               '2025-03-03', '2025-03-10', '2025-03-17', '2025-03-24',
               '2025-03-31', '2025-04-07', '2025-04-14', '2025-04-21',
               '2025-04-28', '2025-05-05', '2025-05-12', '2025-05-19',
               '2025-05-26', '2025-06-02', '2025-06-09', '2025-06-16',
               '2025-06-23', '2025-06-30', '2025-07-07', '2025-07-14',
               '2025-07-21', '2025-07-28', '2025-08-04'],
              dtype='datetime64[ns]', freq='W-MON')

In [39]:
import pandas as pd
import numpy as np
date_0=pd.to_datetime(pd.date_range("2025-08-12",periods=5,freq="D"))
sales=np.array([200,100,400,2000,350])
df=pd.DataFrame({'Date':date_0,"sale":sales})
df["avg_sales"]=df["sale"].rolling(window=2).mean()
df

        Date  sale  avg_sales
0 2025-08-12   200        NaN
1 2025-08-13   100      150.0
2 2025-08-14   400      250.0
3 2025-08-15  2000     1200.0
4 2025-08-16   350     1175.0

In [40]:
df["cumulative_sum"]=df["sale"].expanding().sum()
df

        Date  sale  avg_sales  cumulative_sum
0 2025-08-12   200        NaN           200.0
1 2025-08-13   100      150.0           300.0
2 2025-08-14   400      250.0           700.0
3 2025-08-15  2000     1200.0          2700.0
4 2025-08-16   350     1175.0          3050.0

In [42]:
df["total_sales"]=df["cumulative_sum"].rolling(window=2).sum()
df

        Date  sale  avg_sales  cumulative_sum  total_sales
0 2025-08-12   200        NaN           200.0          NaN
1 2025-08-13   100      150.0           300.0        500.0
2 2025-08-14   400      250.0           700.0       1000.0
3 2025-08-15  2000     1200.0          2700.0       3400.0
4 2025-08-16   350     1175.0          3050.0       5750.0

In [49]:
import pandas as pd
daily_sales = pd.DataFrame({
    'Date': ['2024-08-01', '2024-08-01', '2024-08-02', '2024-08-02', '2024-08-03'],
    'Item': ['Vanilla', 'Chocolate', 'Vanilla', 'Pista', 'Vanilla'],
    'Quantity': [5, 3, 4, 2, 6],
    'Salesperson': ['Priya', 'Amit', 'Priya', 'Neha', 'Amit']
})
daily_sales
pivot=pd.pivot_table(
    daily_sales,
    columns='Item',
    index='Salesperson',
    values='Quantity',
    aggfunc='sum',
    fill_value=0
)
pivot

Item         Chocolate  Pista  Vanilla
Salesperson
Amit                 3      0        6
Neha                 0      2        0
Priya                0      0        9

In [58]:
import numpy as np
import pandas as pd
dict1={
  'Name': ['Student1', 'Student2', 'Student3', 'Student4', 'Student5'],
  'Age': [20, np.nan, 22, 21, np.nan],
  'Score': [88, 92, np.nan, 75, 85]
}

df=pd.DataFrame(dict1)
pivot_tab=pd.pivot_table(
    df,
    index=None,
    columns='Name',
    values='Score',
    fill_value=0,
    dropna=True
)
pivot_tab

Name   Student1  Student2  Student4  Student5
Score      88.0      92.0      75.0      85.0

In [9]:
import pandas as pd
import numpy as np

# Create a synthetic dataset
data = {
    'Date': pd.to_datetime(['2025-08-01', '2025-08-01', '2025-08-02', '2025-08-02', '2025-08-03', '2025-08-03', '2025-08-03', '2025-08-04']),
    'Salesperson': ['Priya', 'Amit', 'Priya', 'Amit', 'Neha', 'Priya', 'Neha', 'Rohit'],
    'Item_Code': ['V_01', 'C_02', 'V_01', 'C_02', 'P_03', 'V_01', 'P_03', 'M_04'],
    'Quantity': [5, 3, 4, 2, 6, 5, 6, 3],
    'Price_INR': [120, 150, 120, 150, 180, 120, 180, 160],
    'Notes': ['First order', 'Large order', 'Daily restock', 'Online', 'New customer', 'Quick sale', 'Daily restock', 'Rush order']
}
df=pd.DataFrame(data)
df

        Date Salesperson Item_Code  Quantity  Price_INR          Notes
0 2025-08-01       Priya      V_01         5        120    First order
1 2025-08-01        Amit      C_02         3        150    Large order
2 2025-08-02       Priya      V_01         4        120  Daily restock
3 2025-08-02        Amit      C_02         2        150         Online
4 2025-08-03        Neha      P_03         6        180   New customer
5 2025-08-03       Priya      V_01         5        120     Quick sale
6 2025-08-03        Neha      P_03         6        180  Daily restock
7 2025-08-04       Rohit      M_04         3        160     Rush order

In [10]:
duplicate=pd.concat([df,df.loc[[1]]],ignore_index=True)
duplicate

        Date Salesperson Item_Code  Quantity  Price_INR          Notes
0 2025-08-01       Priya      V_01         5        120    First order
1 2025-08-01        Amit      C_02         3        150    Large order
2 2025-08-02       Priya      V_01         4        120  Daily restock
3 2025-08-02        Amit      C_02         2        150         Online
4 2025-08-03        Neha      P_03         6        180   New customer
5 2025-08-03       Priya      V_01         5        120     Quick sale
6 2025-08-03        Neha      P_03         6        180  Daily restock
7 2025-08-04       Rohit      M_04         3        160     Rush order
8 2025-08-01        Amit      C_02         3        150    Large order

In [16]:
duplicate_value=duplicate.duplicated(keep=False)
print(duplicate_value)

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8     True
dtype: bool

In [17]:
duplicate[duplicate_value]

        Date Salesperson Item_Code  Quantity  Price_INR        Notes
1 2025-08-01        Amit      C_02         3        150  Large order
8 2025-08-01        Amit      C_02         3        150  Large order

In [18]:
droped=duplicate.drop_duplicates(keep="first")
droped

        Date Salesperson Item_Code  Quantity  Price_INR          Notes
0 2025-08-01       Priya      V_01         5        120    First order
1 2025-08-01        Amit      C_02         3        150    Large order
2 2025-08-02       Priya      V_01         4        120  Daily restock
3 2025-08-02        Amit      C_02         2        150         Online
4 2025-08-03        Neha      P_03         6        180   New customer
5 2025-08-03       Priya      V_01         5        120     Quick sale
6 2025-08-03        Neha      P_03         6        180  Daily restock
7 2025-08-04       Rohit      M_04         3        160     Rush order

In [31]:
import pandas as pd
import numpy as np

# Create our primary sales data file
data_sales = {
    'OrderID': [101, 102, 103, 104, 105],
    'Date': pd.to_datetime(['2025-08-01', '2025-08-01', '2025-08-02', '2025-08-03', '2025-08-04']),
    'Salesperson': ['Priya', 'Amit', 'Priya', 'Neha', 'Rohit'],
    'Item_Code': ['V_01', 'C_02', 'V_01', 'P_03', 'M_04'],
    'Quantity': [5, 3, 4, 6, 3],
    'Price_INR': [120, 150, 120, 180, 160]
}
sales_df = pd.DataFrame(data_sales)
data_items = {
    'Item_Code': ['V_01', 'C_02', 'P_03', 'M_04', 'S_05'],
    'Item_Name': ['Vanilla', 'Chocolate', 'Pista', 'Mango', 'Strawberry'],
    'Category': ['Standard', 'Standard', 'Premium', 'Premium', 'Standard']
}
items_df = pd.DataFrame(data_items)

In [32]:
inner=sales_df.merge(items_df,on="Item_Code",how="inner")
inner

,OrderID,Date,Salesperson,Item_Code,Quantity,Price_INR,Item_Name,Category
0,101,2025-08-01,Priya,V_01,5,120,Vanilla,Standard
1,102,2025-08-01,Amit,C_02,3,150,Chocolate,Standard
2,103,2025-08-02,Priya,V_01,4,120,Vanilla,Standard
3,104,2025-08-03,Neha,P_03,6,180,Pista,Premium
4,105,2025-08-04,Rohit,M_04,3,160,Mango,Premium

In [33]:
outer=sales_df.merge(items_df,on="Item_Code",how="outer")
outer

,OrderID,Date,Salesperson,Item_Code,Quantity,Price_INR,Item_Name,Category
0,102.0,2025-08-01,Amit,C_02,3.0,150.0,Chocolate,Standard
1,105.0,2025-08-04,Rohit,M_04,3.0,160.0,Mango,Premium
2,104.0,2025-08-03,Neha,P_03,6.0,180.0,Pista,Premium
3,NaN,NaT,NaN,S_05,NaN,NaN,Strawberry,Standard
4,101.0,2025-08-01,Priya,V_01,5.0,120.0,Vanilla,Standard
5,103.0,2025-08-02,Priya,V_01,4.0,120.0,Vanilla,Standard

In [34]:
left=sales_df.merge(items_df,on="Item_Code",how="left")
left

,OrderID,Date,Salesperson,Item_Code,Quantity,Price_INR,Item_Name,Category
0,101,2025-08-01,Priya,V_01,5,120,Vanilla,Standard
1,102,2025-08-01,Amit,C_02,3,150,Chocolate,Standard
2,103,2025-08-02,Priya,V_01,4,120,Vanilla,Standard
3,104,2025-08-03,Neha,P_03,6,180,Pista,Premium
4,105,2025-08-04,Rohit,M_04,3,160,Mango,Premium

In [35]:
right=sales_df.merge(items_df,on="Item_Code",how="right")
right

,OrderID,Date,Salesperson,Item_Code,Quantity,Price_INR,Item_Name,Category
0,101.0,2025-08-01,Priya,V_01,5.0,120.0,Vanilla,Standard
1,103.0,2025-08-02,Priya,V_01,4.0,120.0,Vanilla,Standard
2,102.0,2025-08-01,Amit,C_02,3.0,150.0,Chocolate,Standard
3,104.0,2025-08-03,Neha,P_03,6.0,180.0,Pista,Premium
4,105.0,2025-08-04,Rohit,M_04,3.0,160.0,Mango,Premium
5,NaN,NaT,NaN,S_05,NaN,NaN,Strawberry,Standard

In [36]:
sales_df["month"]=sales_df["Date"].dt.month
sales_df

   OrderID       Date Salesperson Item_Code  Quantity  Price_INR  month
0      101 2025-08-01       Priya      V_01         5        120      8
1      102 2025-08-01        Amit      C_02         3        150      8
2      103 2025-08-02       Priya      V_01         4        120      8
3      104 2025-08-03        Neha      P_03         6        180      8
4      105 2025-08-04       Rohit      M_04         3        160      8

In [37]:
sales_df["year"]=sales_df["Date"].dt.year
sales_df

   OrderID       Date Salesperson Item_Code  Quantity  Price_INR  month  year
0      101 2025-08-01       Priya      V_01         5        120      8  2025
1      102 2025-08-01        Amit      C_02         3        150      8  2025
2      103 2025-08-02       Priya      V_01         4        120      8  2025
3      104 2025-08-03        Neha      P_03         6        180      8  2025
4      105 2025-08-04       Rohit      M_04         3        160      8  2025

In [40]:
sales_df["Day"]=sales_df["Date"].dt.day_name()
sales_df

,OrderID,Date,Salesperson,Item_Code,Quantity,Price_INR,month,year,Day
0,101,2025-08-01,Priya,V_01,5,120,8,2025,Friday
1,102,2025-08-01,Amit,C_02,3,150,8,2025,Friday
2,103,2025-08-02,Priya,V_01,4,120,8,2025,Saturday
3,104,2025-08-03,Neha,P_03,6,180,8,2025,Sunday
4,105,2025-08-04,Rohit,M_04,3,160,8,2025,Monday

In [41]:
sales_df

,OrderID,Date,Salesperson,Item_Code,Quantity,Price_INR,month,year,Day
0,101,2025-08-01,Priya,V_01,5,120,8,2025,Friday
1,102,2025-08-01,Amit,C_02,3,150,8,2025,Friday
2,103,2025-08-02,Priya,V_01,4,120,8,2025,Saturday
3,104,2025-08-03,Neha,P_03,6,180,8,2025,Sunday
4,105,2025-08-04,Rohit,M_04,3,160,8,2025,Monday

In [43]:
pivot=pd.pivot_table(
    sales_df,
    index="Item_Code",
    columns="Salesperson",
    values="Quantity",
    fill_value=0,
    dropna=True,
    aggfunc="mean"
)
pivot

Salesperson  Amit  Neha  Priya  Rohit
Item_Code
C_02          3.0   0.0    0.0    0.0
M_04          0.0   0.0    0.0    3.0
P_03          0.0   6.0    0.0    0.0
V_01          0.0   0.0    4.5    0.0